# Owner Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectorManager..::..Owner Property
ConnectorManager Class See Also
---
This property is used to retrieve the owner of the Connector Manager.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Element Owner { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Owner As Element
	Get
```

Visual C++
---
```text
public:
property Element^ Owner {
	Element^ get ();
}
```

# See Also
ConnectorManager Class
Autodesk.Revit.DB Namespace